# This file contains the list of extensions that I use in my VS Code setup.
# You can create a new list by running the following command:
# code --list-extensions > extensions.txt

# To read the list of extensions from this file, 
# remove the comment symbol (#) from the beginning of each line 
# and run the following command in zsh:
#
# while read extension; do
#    if [[ $extension != \#* ]]; then
#        code --install-extension $extension
#    fi
# done < extensions.txt

calebfiggers.typst-companion
charliermarsh.ruff
chrischinchilla.vscode-pandoc
christian-kohler.path-intellisense
donjayamanne.githistory
dunstontc.viml
ecmel.vscode-html-css
github.copilot
github.copilot-chat
github.vscode-pull-request-github
james-yu.latex-workshop
mgt19937.typst-preview
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
notzaki.pandocciter
nvarner.typst-lsp
pkief.material-icon-theme
quarto.quarto
reditorsupport.r
shd101wyy.markdown-preview-enhanced
tianyishi.rmarkdown
tomoki1207.pdf
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode-completions
visualstudioexptteam.vscodeintellicode-insiders
vscodevim.vim
whizkydee.material-palenight-theme
yzhang.markdown-all-in-one
