charliermarsh.ruff
chrischinchilla.vscode-pandoc
christian-kohler.path-intellisense
ckolkman.vscode-postgres
cmoog.sqlnotebook
davidanson.vscode-markdownlint
donjayamanne.githistory
dunstontc.viml
github.copilot
github.copilot-chat
ionutvmi.path-autocomplete
james-yu.latex-workshop
mathematic.vscode-pdf
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-docker
ms-mssql.mssql
ms-python.debugpy
ms-python.python
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-vscode-remote.remote-containers
ms-vscode.vscode-copilot-data-analysis
ms-vscode.vscode-websearchforcopilot
notzaki.pandocciter
quarto.quarto
rdebugger.r-debugger
redhat.vscode-yaml
reditorsupport.r
shd101wyy.markdown-preview-enhanced
sumneko.lua
tianyishi.rmarkdown
vscodevim.vim
vsls-contrib.gistfs
yy0931.vscode-sqlite3-editor
yzhang.markdown-all-in-one
