charliermarsh.ruff
chrischinchilla.vscode-pandoc
christian-kohler.path-intellisense
clemenspeters.format-json
davidanson.vscode-markdownlint
dbcode.dbcode
docker.docker
donjayamanne.githistory
github.codespaces
github.copilot
github.copilot-chat
github.vscode-pull-request-github
google.geminicodeassist
ionutvmi.path-autocomplete
james-yu.latex-workshop
kameshkotwani.google-search
mathematic.vscode-pdf
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-playwright.playwright
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-copilot-vision
ms-vscode.vscode-speech
ms-vscode.vscode-websearchforcopilot
notzaki.pandocciter
quarto.quarto
rdebugger.r-debugger
redhat.vscode-yaml
reditorsupport.r
reditorsupport.r-syntax
rooveterinaryinc.roo-cline
shd101wyy.markdown-preview-enhanced
tianyishi.rmarkdown
vscodevim.vim
vsls-contrib.gistfs
yy0931.vscode-sqlite3-editor
yzhang.markdown-all-in-one
