anthropic.claude-code
davidanson.vscode-markdownlint
formulahendry.code-runner
formulahendry.code-runner-copilot
genaiscript.genaiscript-vscode
github.copilot-chat
github.vscode-pull-request-github
james-yu.latex-workshop
kilocode.kilo-code
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-copilot-vision
ms-vscode.vscode-websearchforcopilot
quarto.quarto
qwenlm.qwen-code-vscode-ide-companion
redhat.vscode-yaml
reditorsupport.r
reditorsupport.r-syntax
rooveterinaryinc.roo-cline
shd101wyy.markdown-preview-enhanced
sst-dev.opencode
tecosaur.latex-utilities
vscodevim.vim
wassimdev.wassimdev-vscode-deepseek
yy0931.vscode-sqlite3-editor
yzhang.markdown-all-in-one
